In [6]:
import pandas as pd
import numpy as np

students_performance = pd.read_csv('https://stepik.org/media/attachments/course/4852/StudentsPerformance.csv')

In [7]:
# отобрать всех female можно так же с помощью атрибута loc, только внутри использовать булевое выражение
students_performance.loc[students_performance.gender == 'female']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [8]:
# в предыдущем запросе можно дополнительно ограничить выдачу только двумя столбцами:
students_performance.loc[students_performance.gender == 'female', ['gender', 'writing score']]

     gender  writing score
0    female             74
1    female             88
2    female             93
5    female             78
6    female             92
..      ...            ...
993  female             74
995  female             95
997  female             65
998  female             77
999  female             86

[518 rows x 2 columns]

In [9]:
# задача вывести только те строки, в которых writing score выше среднего
# шаг 1: обратиться к серии writing score и найти ее среднее:
writing_score_mean = students_performance['writing score'].mean()

In [10]:
# шаг 2: отобрать из датафрейма нужные данные:
students_performance.loc[students_performance['writing score'] > writing_score_mean]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [11]:
# если для отбора нам нужно задать 2 условия, напр. к предыдущему запросу добавить отбор по полу студента, синтаксис будет отличаться от питоновского:
query = (students_performance['writing score'] > writing_score_mean) & (students_performance.gender == 'female')
# на выходе получается серия булевых значений как результат сравнения двух пандовских серий

In [12]:
students_performance.loc[query].head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [13]:
query_lunch = students_performance.lunch == 'free/reduced'
students_performance.loc[query_lunch]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50
17,female,group B,some high school,free/reduced,none,18,32,28
...,...,...,...,...,...,...,...,...
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
999,female,group D,some college,free/reduced,none,77,86,86

In [14]:
students_performance.loc[query_lunch].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

In [15]:
query_lunch_std = students_performance.lunch == 'standard'
students_performance.loc[query_lunch_std].describe()

       math score  reading score  writing score
count  645.000000     645.000000     645.000000
mean    70.034109      71.654264      70.823256
std     13.653501      13.830602      14.339487
min     19.000000      26.000000      22.000000
25%     61.000000      63.000000      62.000000
50%     69.000000      72.000000      72.000000
75%     80.000000      82.000000      81.000000
max    100.000000     100.000000     100.000000

In [16]:
students_performance.loc[query_lunch].var()

C:\Users\Ira Zurina\AppData\Local\Temp\ipykernel_1360\1403150446.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  students_performance.loc[query_lunch].var()

math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [17]:
students_performance.loc[query_lunch_std].var()

C:\Users\Ira Zurina\AppData\Local\Temp\ipykernel_1360\2019558848.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  students_performance.loc[query_lunch_std].var()

math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

In [18]:
# в датафрейме названия столбцов с пробелами, их надо убрать, для этого переименовать столбцы:
students_performance = students_performance \
                                    .rename(columns=
                                            {'parental level of education': 'parental_level_of_education',
                                            'test preparation course': 'test_preparation_course',
                                            'math score': 'math_score',
                                            'reading score': 'reading_score',
                                            'writing score': 'writing_score'})

In [19]:
students_performance.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [20]:
# еще один метод для обработки запросов - query, который может обращаться как к целочисленным значениям:
students_performance.query("writing_score > 74")

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [23]:
# ... так и к сравнению со строковыми данными (!обратить внимание на дополнительные кавычки!):
students_performance.query("gender == 'female'").head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [24]:
# ... и комбинации запросов:
students_performance.query("gender == 'female' | writing_score > 78").head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [25]:
# Если значение для сравнения записано в переменную, то ее нельзя просто подставить в неравенство, ее нужно экранировать (@):
writing_score_query = 78
students_performance.query("writing_score > @writing_score_query").head()
#теперь необходимо помнить, что при изменении значения переменной, результат запроса тоже будет автоматическимееняться

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
16,male,group C,high school,standard,none,88,89,86
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80

In [26]:
# для сравнения с несколькими строками - ф-ция .isin("...", "...") - в скобках значения, которые нужно отобрать
students_performance['parental_level_of_education'].isin(["bachelor's degree", "master's degree"])
# другой вариант сделать так - создать переменную, в которую записан список значений и использовать сравнение с переменной (не забывая про экранирование):
# variants = ['var1', 'var2']
#df.query('col1 == @variants')

0       True
1      False
2       True
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Name: parental_level_of_education, Length: 1000, dtype: bool

In [29]:
# иногда нужно отобрать не строки, соответствующие нашим условиям, а отдельно взятые колонки
# 1) не-pandas способ (ручной, подходит когда нужно сформировать сложный запрос):
students_performance[['math_score', 'reading_score']].head()
# если колонок много и их можно отобрать по совпадающему слову, то это можно сделать через обращение к списку всех заголовков столбцов:
score_cols = [i for i in list(students_performance) if 'score' in i]
students_performance[score_cols].head()

   math_score  reading_score  writing_score
0          72             72             74
1          69             90             88
2          90             95             93
3          47             57             44
4          76             78             75

In [32]:
# pandas-способ - ф-ция filter - работает как для заголовков столбцов:
students_performance.filter(like='score').head()
#... так и для индексов строк. Для этого надо указать ось выборки (axis=0 - фильтр по строкам, axis=1 - по столбцам (идет по умолчанию))
students_performance.filter(like='score', axis=0).head()

Empty DataFrame
Columns: [gender, race/ethnicity, parental_level_of_education, lunch, test_preparation_course, math_score, reading_score, writing_score]
Index: []